--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY abbas_pk                   ▀▄ ▄▀ 
▀▄ ▄▀     BY abbas_pk (@abbas_pk)    ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY abbas_pk          ▀▄ ▄▀   
▀▄ ▄▀     RE BOT  : ريبلياتي            ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do
ws = {}
rs = {}

-- some examples of how to use this :3 
ws[1] = "هلاو"
rs[1] =  "هلاووووت 😎 حياتي 😍مستقبل 🙊بناتي😹" 

ws[2] = "@abbas_pk" 
rs[2] = "هذا الي صنعني فديت ربه 🙈❤️" 

ws[3] = "شلونكم"
rs[3] = "اني بالنسبة اليه دايح شوف بقيه الاعضااء 😂🖕" 

ws[4] = "ضوجة" 
rs[4] = "شي اكيد الكبل ماكو 😂 لو بعدك/ج مازاحف/ة 🙊😋" 

ws[5] = "مرحبا" 
rs[5] = "مراحب اغاتي نورت شمعة كلبي🙊" 

ws[6] = "@abbas_pk" 
rs[6] = "❤️يمه هذا المطور مالتي فدوه الكلبه😍" 

ws[7] = "السلام عليكم" 
rs[7] = "وعليكم السلام تاج راسي استريحو☺️"

ws[8] = "بوبي"
rs[8] = "😘ـ؏ـمُر بوُبيِ ❤️روَ,وحھَہ 😚لبوُبيِ🙈"

ws[9] = "استغفر الله"
rs[9] = "شبيِ😒اّلمُوُمُن😏مُـ؏ـرفُتگ🤔"

ws[10] = "احبك" 
rs[10] = "واني هم احبك/ج كفشة روحي😍" 

ws[11] = "انجب" 
rs[11] = "😏أذأَ أَكلَكَ مَنَ أَخلآَقَكَ حَتَكَلَي قَدِيَمَهَ حَجآَوَزَكَ بأَلبَلفَأتَ بأَـليَ😂🌚👋"

ws[12] = "شنو رائيك بهاي البنيه"
rs[12] = "هاي اكبر زاحفه ومالها امان وتحب الولد و كل يوم اشوفها دايحه بمول المنصور🙀😹"

ws[13] = "شنو رائيك بهذا الولد" 
rs[13] = "هذا الولد اكبر ادبسز و زاحف  وساقط سوالفه كلها عندي😒😹" 

ws[14] = "زاحف" 
rs[14] = "تعلمت الزحف منك اغاتي😒🖐" 

ws[15] = "منو صنعك" 
rs[15] = "😍 اكو غير ضلعي عباس 😍" 

ws[16] = "هلو"
rs[16] = "هلاوت على النبي صمون حار ولبلبي😋😹" 

ws[17] = "🌚" 
rs[17] = "هذا  وجهك  اكيد حبشي😹"

ws[19] = "👀" 
rs[19] = "عينك/ج اريد اخذ حمام😡 🛀 💦😹" 

ws[20] = "باي"
rs[20] = "لا تروح لا تروح ابقئ اني مجروح😅" 

ws[21] = "جاو" 
rs[21] = "مايكول الى جاو   ابو الوسخ😏😹" 

ws[22] = "اني" 
rs[22] = "اي انت قرد/ه وزاحف/ه هم😎😹" 

ws[23] = "بوسه"
rs[23] = "امووووووووووووح 💋😘ع خدودك/ج التفاحات😉😍" 

ws[24] = "=اء" 
rs[24] = "هاي😳 حبيبت عباس اوالمطور مالتي😍 يعني الكل بالكل 😌😏يعني تاج راسي و علي😍😌" 

ws[25] = "تحبني" 
rs[25] = "غير اموت على  الله مالكم طبعا احبك/ج اغاتي🙈" 

ws[26] = "يمكن اروح للزوراء" 
rs[26] = "اي يابه 😒طبعا تروح للزوراء كلها حاتات😍 و تزحف علئ راحتك😉" 

ws[27] = "بوبي تجي للزوراء"
rs[27] = "اي اريد تعلمني الزحف😹" 

ws[28] = "تجي للزوراء" 
rs[28] = "دقيقة خلي البس الحذاء👞😹 والقاط👔😹 الجديد علمود الحاتات هناك👩 واحضر رقمي حتئ اصير زاحف😹" 

ws[29] = "اكرهك"
rs[29] = "طبك مرض اني هم اكرهك😒😹"

ws[30] = "عباس" 
rs[30] = "فديت اسمه دوولة" 

ws[31] = "حلو لولا" 
rs[31] = "لعد شبي يخبل بس انت عيونك حول" 

ws[32] = "@Athraa1234567" 
rs[32] = "خير شتريد من حبيبت عباس" 

ws[33] = "هاشم" 
rs[33] = "يَعنِي هآشِم يعني الضِلِع 😻 صآحِب الگروُب 😎" 

ws[34] = "هند" 
rs[34] = "يمه يمه حلوة الكروب  ملكة لكروب وربي احلى ضلعة يعني دولة ولصبووووووح " 

ws[35] = "شبيك" 
rs[35] = "شبت بيك ومنطفت" 

ws[36] = "ملطلط" 
rs[36] = "ماكو غيرك ملطلط وزاحف  ملكلك" 

ws[37] = "ننه" 
rs[37] = "الضلعة الزينه وربي دولة" 

ws[38] = "شلونك بوبي" 
rs[38] = "وردة تمام بشوفت حروفك/ج" 

ws[39] = "تخليني"
rs[39] = "بـيِكَ خيَرَ 😉 تعـآَلَ 😉😂" 

ws[40] = "😢"
rs[40] = "يِأَ لـَمعَةَ 👁 ليَشَ تبَجي/ن 😊 وبوُبيِ يمَك/جَ🙈"

ws[41] = "😂"
rs[41] = "😉 لتَضحَكَ هوأآ‘إيَ ✋🏿 يصيَر فأَولَ 😜"

ws[42] = "😭"
rs[42] = "يِأَ لـَمعَةَ 👁 ليَشَ تبَجي/ن 😊 وبوُبيِ يمَك/جَ🙈"

ws[43] = "😒"
rs[43] = "💦وُجَھَہ اّلسـﮩطَل😒شبيِگ تباّوُـ؏ـ صےفُحِ😏"

ws[44] = "😏"
rs[44] = "🤔اّيِباّاّاّاّھَہ شنوُ ھَہل نضرة😕 اّلمُخِيِفُة يِاّوُگحِ 😝"

ws[45] = "😡"
rs[45] = "تلاّحِگوُ 😳سـﮩطَل مُيِ😂 باّرد💦💧 حِمُھَہ/ت🔥🔥"

ws[46] = "🙄"
rs[46] = "اّللھَہ🙏يِشاّفُيِگ 😝شوُگت🤔 نحِوُلت👀"

ws[47] = "😐"
rs[47] = "اّلصےفُنھَہ😐 مُوُ اّلگ☺️ لبوُ صےاّبر 😂😂😂ھَہـ؏ـ ھَہـ؏ـ😅😅"

ws[48] = "😉" 
rs[48] = "صےاّيِر/ھَہ 😐 وُگحِ/ھَہ 😒 اّشمُر وغَمُزاّت😏"

ws[49] = "تف"
rs[49] = "🌹مضَـغـوَطَ أخلآَقـي متَسمَحليٍ أَرد َعليَكِ 😂"


-- the main function
function run( msg, matches )
	-- just a local variables that i used in my algorithm  
	local i = 0; local w = false

	-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
	-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
	for k,v in pairs(ws) do
		-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
		if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
			-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
			i = k; w = true;
		end
	end

	-- check if { w } is not false and { i } not equals to 0
	if ( (w ~= false) and (i ~= 0) ) then
		-- get the receiver :3 
		R = get_receiver(msg)
		-- send him the proper message from the index that { i } assigned to
		--send_large_msg ( R , rs[i] );
		--send_reply(msg.id, rs[i])
		reply_msg(msg.id, rs[i], ok_cb, false )
	end
	
	-- don't edit this section
	if ( msg.text == "about" ) then
		if ( msg.from.username == "abbas_pk" ) then
			R = get_receiver(msg)
			send_large_msg ( R , "Made by @abbas_pk" );
		end
	end 

end



return {
	patterns = {
		"(.*)"		
  	},
  	run = run
} 


end